{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000, 2], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000, 2], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "s1_c1", "class_name": "Conv1D", "config": {"name": "s1_c1", "trainable": false, "filters": 128, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "s2_c1", "class_name": "Conv1D", "config": {"name": "s2_c1", "trainable": false, "filters": 32, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "s1_a1", "class_name": "Activation", "config": {"name": "s1_a1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s1_c1", 0, 0, {}]]]}, {"name": "s2_a1", "class_name": "Activation", "config": {"name": "s2_a1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s2_c1", 0, 0, {}]]]}, {"name": "s1_n1", "class_name": "BatchNormalization", "config": {"name": "s1_n1", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_a1", 0, 0, {}]]]}, {"name": "s2_n1", "class_name": "BatchNormalization", "config": {"name": "s2_n1", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_a1", 0, 0, {}]]]}, {"name": "s1_p1", "class_name": "AveragePooling1D", "config": {"name": "s1_p1", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s1_n1", 0, 0, {}]]]}, {"name": "s2_p1", "class_name": "AveragePooling1D", "config": {"name": "s2_p1", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s2_n1", 0, 0, {}]]]}, {"name": "s1_c2", "class_name": "Conv1D", "config": {"name": "s1_c2", "trainable": false, "filters": 128, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_p1", 0, 0, {}]]]}, {"name": "s2_c2", "class_name": "Conv1D", "config": {"name": "s2_c2", "trainable": false, "filters": 32, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_p1", 0, 0, {}]]]}, {"name": "s1_a2", "class_name": "Activation", "config": {"name": "s1_a2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s1_c2", 0, 0, {}]]]}, {"name": "s2_a2", "class_name": "Activation", "config": {"name": "s2_a2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s2_c2", 0, 0, {}]]]}, {"name": "s1_n2", "class_name": "BatchNormalization", "config": {"name": "s1_n2", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_a2", 0, 0, {}]]]}, {"name": "s2_n2", "class_name": "BatchNormalization", "config": {"name": "s2_n2", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_a2", 0, 0, {}]]]}, {"name": "s1_p2", "class_name": "AveragePooling1D", "config": {"name": "s1_p2", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s1_n2", 0, 0, {}]]]}, {"name": "s2_p2", "class_name": "AveragePooling1D", "config": {"name": "s2_p2", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s2_n2", 0, 0, {}]]]}, {"name": "s1_c3", "class_name": "Conv1D", "config": {"name": "s1_c3", "trainable": false, "filters": 128, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_p2", 0, 0, {}]]]}, {"name": "s2_c3", "class_name": "Conv1D", "config": {"name": "s2_c3", "trainable": false, "filters": 32, "kernel_size": [9], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_p2", 0, 0, {}]]]}, {"name": "s1_a3", "class_name": "Activation", "config": {"name": "s1_a3", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s1_c3", 0, 0, {}]]]}, {"name": "s2_a3", "class_name": "Activation", "config": {"name": "s2_a3", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s2_c3", 0, 0, {}]]]}, {"name": "s1_n3", "class_name": "BatchNormalization", "config": {"name": "s1_n3", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_a3", 0, 0, {}]]]}, {"name": "s2_n3", "class_name": "BatchNormalization", "config": {"name": "s2_n3", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_a3", 0, 0, {}]]]}, {"name": "s1_p3", "class_name": "AveragePooling1D", "config": {"name": "s1_p3", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s1_n3", 0, 0, {}]]]}, {"name": "s2_p3", "class_name": "AveragePooling1D", "config": {"name": "s2_p3", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s2_n3", 0, 0, {}]]]}, {"name": "s1_c4", "class_name": "Conv1D", "config": {"name": "s1_c4", "trainable": false, "filters": 256, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_p3", 0, 0, {}]]]}, {"name": "s2_c4", "class_name": "Conv1D", "config": {"name": "s2_c4", "trainable": false, "filters": 512, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_p3", 0, 0, {}]]]}, {"name": "s1_a4", "class_name": "Activation", "config": {"name": "s1_a4", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s1_c4", 0, 0, {}]]]}, {"name": "s2_a4", "class_name": "Activation", "config": {"name": "s2_a4", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s2_c4", 0, 0, {}]]]}, {"name": "s1_n4", "class_name": "BatchNormalization", "config": {"name": "s1_n4", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_a4", 0, 0, {}]]]}, {"name": "s2_n4", "class_name": "BatchNormalization", "config": {"name": "s2_n4", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_a4", 0, 0, {}]]]}, {"name": "s1_p4", "class_name": "AveragePooling1D", "config": {"name": "s1_p4", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s1_n4", 0, 0, {}]]]}, {"name": "s2_p4", "class_name": "AveragePooling1D", "config": {"name": "s2_p4", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s2_n4", 0, 0, {}]]]}, {"name": "s1_c5", "class_name": "Conv1D", "config": {"name": "s1_c5", "trainable": false, "filters": 256, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_p4", 0, 0, {}]]]}, {"name": "s2_c5", "class_name": "Conv1D", "config": {"name": "s2_c5", "trainable": false, "filters": 512, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_p4", 0, 0, {}]]]}, {"name": "s1_a5", "class_name": "Activation", "config": {"name": "s1_a5", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s1_c5", 0, 0, {}]]]}, {"name": "s2_a5", "class_name": "Activation", "config": {"name": "s2_a5", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s2_c5", 0, 0, {}]]]}, {"name": "s1_n5", "class_name": "BatchNormalization", "config": {"name": "s1_n5", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_a5", 0, 0, {}]]]}, {"name": "s2_n5", "class_name": "BatchNormalization", "config": {"name": "s2_n5", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_a5", 0, 0, {}]]]}, {"name": "s1_p5", "class_name": "AveragePooling1D", "config": {"name": "s1_p5", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s1_n5", 0, 0, {}]]]}, {"name": "s2_p5", "class_name": "AveragePooling1D", "config": {"name": "s2_p5", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s2_n5", 0, 0, {}]]]}, {"name": "s1_c6", "class_name": "Conv1D", "config": {"name": "s1_c6", "trainable": false, "filters": 256, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_p5", 0, 0, {}]]]}, {"name": "s2_c6", "class_name": "Conv1D", "config": {"name": "s2_c6", "trainable": false, "filters": 512, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_p5", 0, 0, {}]]]}, {"name": "s1_a6", "class_name": "Activation", "config": {"name": "s1_a6", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s1_c6", 0, 0, {}]]]}, {"name": "s2_a6", "class_name": "Activation", "config": {"name": "s2_a6", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s2_c6", 0, 0, {}]]]}, {"name": "s1_n6", "class_name": "BatchNormalization", "config": {"name": "s1_n6", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_a6", 0, 0, {}]]]}, {"name": "s2_n6", "class_name": "BatchNormalization", "config": {"name": "s2_n6", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_a6", 0, 0, {}]]]}, {"name": "s1_p6", "class_name": "AveragePooling1D", "config": {"name": "s1_p6", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s1_n6", 0, 0, {}]]]}, {"name": "s2_p6", "class_name": "AveragePooling1D", "config": {"name": "s2_p6", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s2_n6", 0, 0, {}]]]}, {"name": "s1_c7", "class_name": "Conv1D", "config": {"name": "s1_c7", "trainable": false, "filters": 256, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_p6", 0, 0, {}]]]}, {"name": "s2_c7", "class_name": "Conv1D", "config": {"name": "s2_c7", "trainable": false, "filters": 512, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_p6", 0, 0, {}]]]}, {"name": "s1_a7", "class_name": "Activation", "config": {"name": "s1_a7", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s1_c7", 0, 0, {}]]]}, {"name": "s2_a7", "class_name": "Activation", "config": {"name": "s2_a7", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s2_c7", 0, 0, {}]]]}, {"name": "s1_n7", "class_name": "BatchNormalization", "config": {"name": "s1_n7", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_a7", 0, 0, {}]]]}, {"name": "s2_n7", "class_name": "BatchNormalization", "config": {"name": "s2_n7", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_a7", 0, 0, {}]]]}, {"name": "s1_p7", "class_name": "AveragePooling1D", "config": {"name": "s1_p7", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s1_n7", 0, 0, {}]]]}, {"name": "s2_p7", "class_name": "AveragePooling1D", "config": {"name": "s2_p7", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s2_n7", 0, 0, {}]]]}, {"name": "s1_c8", "class_name": "Conv1D", "config": {"name": "s1_c8", "trainable": false, "filters": 256, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_p7", 0, 0, {}]]]}, {"name": "s2_c8", "class_name": "Conv1D", "config": {"name": "s2_c8", "trainable": false, "filters": 512, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_p7", 0, 0, {}]]]}, {"name": "s1_a8", "class_name": "Activation", "config": {"name": "s1_a8", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s1_c8", 0, 0, {}]]]}, {"name": "s2_a8", "class_name": "Activation", "config": {"name": "s2_a8", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s2_c8", 0, 0, {}]]]}, {"name": "s1_n8", "class_name": "BatchNormalization", "config": {"name": "s1_n8", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_a8", 0, 0, {}]]]}, {"name": "s2_n8", "class_name": "BatchNormalization", "config": {"name": "s2_n8", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_a8", 0, 0, {}]]]}, {"name": "s1_p8", "class_name": "AveragePooling1D", "config": {"name": "s1_p8", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s1_n8", 0, 0, {}]]]}, {"name": "s2_p8", "class_name": "AveragePooling1D", "config": {"name": "s2_p8", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s2_n8", 0, 0, {}]]]}, {"name": "s1_c9", "class_name": "Conv1D", "config": {"name": "s1_c9", "trainable": false, "filters": 256, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_p8", 0, 0, {}]]]}, {"name": "s2_c9", "class_name": "Conv1D", "config": {"name": "s2_c9", "trainable": false, "filters": 512, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_p8", 0, 0, {}]]]}, {"name": "s1_a9", "class_name": "Activation", "config": {"name": "s1_a9", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s1_c9", 0, 0, {}]]]}, {"name": "s2_a9", "class_name": "Activation", "config": {"name": "s2_a9", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["s2_c9", 0, 0, {}]]]}, {"name": "s1_n9", "class_name": "BatchNormalization", "config": {"name": "s1_n9", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_a9", 0, 0, {}]]]}, {"name": "s2_n9", "class_name": "BatchNormalization", "config": {"name": "s2_n9", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_a9", 0, 0, {}]]]}, {"name": "s1_p9", "class_name": "AveragePooling1D", "config": {"name": "s1_p9", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s1_n9", 0, 0, {}]]]}, {"name": "s2_p9", "class_name": "AveragePooling1D", "config": {"name": "s2_p9", "trainable": false, "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["s2_n9", 0, 0, {}]]]}, {"name": "s1_f", "class_name": "Flatten", "config": {"name": "s1_f", "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["s1_p9", 0, 0, {}]]]}, {"name": "s2_f", "class_name": "Flatten", "config": {"name": "s2_f", "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["s2_p9", 0, 0, {}]]]}, {"name": "s1_d1", "class_name": "Dense", "config": {"name": "s1_d1", "trainable": false, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_f", 0, 0, {}]]]}, {"name": "s2_d1", "class_name": "Dense", "config": {"name": "s2_d1", "trainable": false, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_f", 0, 0, {}]]]}, {"name": "s1_n10", "class_name": "BatchNormalization", "config": {"name": "s1_n10", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_d1", 0, 0, {}]]]}, {"name": "s2_n10", "class_name": "BatchNormalization", "config": {"name": "s2_n10", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_d1", 0, 0, {}]]]}, {"name": "s1_d2", "class_name": "Dense", "config": {"name": "s1_d2", "trainable": false, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_n10", 0, 0, {}]]]}, {"name": "s2_d2", "class_name": "Dense", "config": {"name": "s2_d2", "trainable": false, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_n10", 0, 0, {}]]]}, {"name": "s1_n11", "class_name": "BatchNormalization", "config": {"name": "s1_n11", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_d2", 0, 0, {}]]]}, {"name": "s2_n11", "class_name": "BatchNormalization", "config": {"name": "s2_n11", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_d2", 0, 0, {}]]]}, {"name": "s1_d3", "class_name": "Dense", "config": {"name": "s1_d3", "trainable": false, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_n11", 0, 0, {}]]]}, {"name": "s2_d3", "class_name": "Dense", "config": {"name": "s2_d3", "trainable": false, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_n11", 0, 0, {}]]]}, {"name": "s1_n12", "class_name": "BatchNormalization", "config": {"name": "s1_n12", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s1_d3", 0, 0, {}]]]}, {"name": "s2_n12", "class_name": "BatchNormalization", "config": {"name": "s2_n12", "trainable": false, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["s2_d3", 0, 0, {}]]]}, {"name": "s1_sm", "class_name": "Dense", "config": {"name": "s1_sm", "trainable": false, "units": 75, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s1_n12", 0, 0, {}]]]}, {"name": "s2_sm", "class_name": "Dense", "config": {"name": "s2_sm", "trainable": false, "units": 75, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["s2_n12", 0, 0, {}]]]}, {"name": "merge", "class_name": "Concatenate", "config": {"name": "merge", "trainable": true, "axis": 1}, "inbound_nodes": [[["s1_sm", 0, 0, {}], ["s2_sm", 0, 0, {}]]]}, {"name": "d1", "class_name": "Dense", "config": {"name": "d1", "trainable": true, "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["merge", 0, 0, {}]]]}, {"name": "n1", "class_name": "BatchNormalization", "config": {"name": "n1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["d1", 0, 0, {}]]]}, {"name": "a1", "class_name": "Activation", "config": {"name": "a1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["n1", 0, 0, {}]]]}, {"name": "d2", "class_name": "Dense", "config": {"name": "d2", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["a1", 0, 0, {}]]]}, {"name": "n2", "class_name": "BatchNormalization", "config": {"name": "n2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["d2", 0, 0, {}]]]}, {"name": "a2", "class_name": "Activation", "config": {"name": "a2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["n2", 0, 0, {}]]]}, {"name": "sm", "class_name": "Dense", "config": {"name": "sm", "trainable": true, "units": 75, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["a2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["sm", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}